# Series

In [125]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

from numpy.random import randn

In [2]:
obj = Series([5,10,15,20])
print(obj)footba;;

0     5
1    10
2    15
3    20
dtype: int64

In [3]:
football = Series([23,18,21,16,14], index=['Roanldo','Messi','Kane','Suarez','Neymar'])
print(football)

Roanldo    23
Messi      18
Kane       21
Suarez     16
Neymar     14
dtype: int64

In [4]:
#check who has scored more than 20 goals
football[football > 20]

Roanldo    23
Kane       21
dtype: int64

In [5]:
 'Ozil' in football

False

In [6]:
#converting Series into Dictionary and vice-versa

football_dict = football.to_dict()
print(football_dict)

{'Roanldo': 23, 'Messi': 18, 'Kane': 21, 'Suarez': 16, 'Neymar': 14}

In [7]:
football = Series(football_dict)
print(football)

Kane       21
Messi      18
Neymar     14
Roanldo    23
Suarez     16
dtype: int64

In [9]:
football.name = 'Goals scored in Champions League'
football

Kane       21
Messi      18
Neymar     14
Roanldo    23
Suarez     16
Name: Goals scored in Champions League, dtype: int64

# DataFrame

In [22]:
#creating DataFrame from lists

data = [['Dhoni',65],['Kholi',58],['Rohit',35]]
df = pd.DataFrame(data, columns = ['Name','Runs'])
df

    Name  Runs
0  Dhoni    65
1  Kholi    58
2  Rohit    35

In [25]:
#creating DataFrame from Dictionary

data = {'Phone':['IphoneX','Samsung S9','Google Pixel2'],'Cost':[1000,850,800]}
df = DataFrame(data)
df

   Cost          Phone
0  1000        IphoneX
1   850     Samsung S9
2   800  Google Pixel2

# Importing from CSV

In [53]:
df = pd.read_csv('Iris.csv')

df.head()

,Dataset Order,Sepal length,Sepal width,Petal length,Petal width,Species
0,1,5.1,3.5,1.4,0.2,I. setosa
1,2,4.9,3.0,1.4,0.2,I. setosa
2,3,4.7,3.2,1.3,0.2,I. setosa
3,4,4.6,3.1,1.5,0.2,I. setosa
4,5,5.0,3.6,1.4,0.3,I. setosa

In [58]:
df.tail()

,Dataset Order,Sepal length,Sepal width,Petal length,Petal width,Species
145,146,6.7,3.0,5.2,2.3,I. virginica
146,147,6.3,2.5,5.0,1.9,I. virginica
147,148,6.5,3.0,5.2,2.0,I. virginica
148,149,6.2,3.4,5.4,2.3,I. virginica
149,150,5.9,3.0,5.1,1.8,I. virginica

In [83]:
df.describe()

       Dataset Order  Sepal length  Sepal width  Petal length  Petal width
count     150.000000    150.000000   150.000000    150.000000   150.000000
mean       75.500000      5.843333     3.057333      3.758000     1.200000
std        43.445368      0.828066     0.435866      1.765298     0.761401
min         1.000000      4.300000     2.000000      1.000000     0.100000
25%        38.250000      5.100000     2.800000      1.600000     0.300000
50%        75.500000      5.800000     3.000000      4.350000     1.300000
75%       112.750000      6.400000     3.300000      5.100000     1.800000
max       150.000000      7.900000     4.400000      6.900000     2.500000

In [59]:
print(df.columns)

Index(['Dataset Order', 'Sepal length', 'Sepal width', 'Petal length',
       'Petal width', 'Species'],
      dtype='object')

In [60]:
df.head(3)

,Dataset Order,Sepal length,Sepal width,Petal length,Petal width,Species
0,1,5.1,3.5,1.4,0.2,I. setosa
1,2,4.9,3.0,1.4,0.2,I. setosa
2,3,4.7,3.2,1.3,0.2,I. setosa

In [62]:
#grabbing specific rows

df.loc[3]

Dataset Order            4
Sepal length           4.6
Sepal width            3.1
Petal length           1.5
Petal width            0.2
Species          I. setosa
Name: 3, dtype: object

In [82]:
df = pd.read_csv('Iris.csv')

df_sub = df.head()
df_sub

,Dataset Order,Sepal length,Sepal width,Petal length,Petal width,Species
0,1,5.1,3.5,1.4,0.2,I. setosa
1,2,4.9,3.0,1.4,0.2,I. setosa
2,3,4.7,3.2,1.3,0.2,I. setosa
3,4,4.6,3.1,1.5,0.2,I. setosa
4,5,5.0,3.6,1.4,0.3,I. setosa

# Re-Indexing

In [84]:
data = Series([5,10,15,20], index = ['P','Q','R','S'])
data

P     5
Q    10
R    15
S    20
dtype: int64

In [85]:
data1 = data.reindex(['P','Q','R','S','T'])
data1

P     5.0
Q    10.0
R    15.0
S    20.0
T     NaN
dtype: float64

In [86]:
data1 = data.reindex(['P','Q','R','S','T'], fill_value = 0)
data1

P     5
Q    10
R    15
S    20
T     0
dtype: int64

In [103]:
df = pd.read_csv('Iris.csv')

df_sub = df.head()
df_sub

,Dataset Order,Sepal length,Sepal width,Petal length,Petal width,Species
0,1,5.1,3.5,1.4,0.2,I. setosa
1,2,4.9,3.0,1.4,0.2,I. setosa
2,3,4.7,3.2,1.3,0.2,I. setosa
3,4,4.6,3.1,1.5,0.2,I. setosa
4,5,5.0,3.6,1.4,0.3,I. setosa

In [110]:
#Changing column names:
df_sub.columns = ['a','b','c','d','e','f']

In [111]:
df_sub

   a    b    c    d    e          f
0  1  5.1  3.5  1.4  0.2  I. setosa
1  2  4.9  3.0  1.4  0.2  I. setosa
2  3  4.7  3.2  1.3  0.2  I. setosa
3  4  4.6  3.1  1.5  0.2  I. setosa
4  5  5.0  3.6  1.4  0.3  I. setosa

In [121]:
#adding a new column

new_columns = ['a','b','c','d','e','f','g']
df_sub_new = df_sub.reindex(columns=new_columns)
df_sub_new

   a    b    c    d    e          f   g
0  1  5.1  3.5  1.4  0.2  I. setosa NaN
1  2  4.9  3.0  1.4  0.2  I. setosa NaN
2  3  4.7  3.2  1.3  0.2  I. setosa NaN
3  4  4.6  3.1  1.5  0.2  I. setosa NaN
4  5  5.0  3.6  1.4  0.3  I. setosa NaN

In [122]:
#replace NaN values with 0

df_sub_new.replace(np.nan,0)

   a    b    c    d    e          f    g
0  1  5.1  3.5  1.4  0.2  I. setosa  0.0
1  2  4.9  3.0  1.4  0.2  I. setosa  0.0
2  3  4.7  3.2  1.3  0.2  I. setosa  0.0
3  4  4.6  3.1  1.5  0.2  I. setosa  0.0
4  5  5.0  3.6  1.4  0.3  I. setosa  0.0

In [135]:
#Dropping rows in DataFrame

df = DataFrame(np.arange(2,11).reshape(3,3), index = ['Messi','Ronaldo','Suarez'], columns = ['Matches','Goals','Assists'])
df

         Matches  Goals  Assists
Messi          2      3        4
Ronaldo        5      6        7
Suarez         8      9       10

In [136]:
df1 = df.drop('Messi')
df1

         Matches  Goals  Assists
Ronaldo        5      6        7
Suarez         8      9       10

In [138]:
#Dropping columns

df2 = df.drop('Goals',axis=1)
df2

         Matches  Assists
Messi          2        4
Ronaldo        5        7
Suarez         8       10

# Selecting Entries:

In [143]:
df = DataFrame(np.arange(25).reshape(5,5), index = ['USA','India','Canada','China','Japan'], columns = ['A','B','C','D','E'])
df

         A   B   C   D   E
USA      0   1   2   3   4
India    5   6   7   8   9
Canada  10  11  12  13  14
China   15  16  17  18  19
Japan   20  21  22  23  24

In [151]:
df.loc['India']

A    5
B    6
C    7
D    8
E    9
Name: India, dtype: int32

In [147]:
df['B']

USA        1
India      6
Canada    11
China     16
Japan     21
Name: B, dtype: int32

In [150]:
df[df['D'] > 10]

         A   B   C   D   E
Canada  10  11  12  13  14
China   15  16  17  18  19
Japan   20  21  22  23  24

# Statistics

In [164]:
df = pd.read_csv('Bank.csv')

df1 = df.head(10)
df1

,Customer ID,Name,Surname,Gender,Age,Region,Job Classification,Date Joined,Balance
0,100000001,Simon,Walsh,Male,21,England,White Collar,05.Jan.15,113810.15
1,400000002,Jasmine,Miller,Female,34,Northern Ireland,Blue Collar,06.Jan.15,36919.73
2,100000003,Liam,Brown,Male,46,England,White Collar,07.Jan.15,101536.83
3,300000004,Trevor,Parr,Male,32,Wales,White Collar,08.Jan.15,1421.52
4,100000005,Deirdre,Pullman,Female,38,England,Blue Collar,09.Jan.15,35639.79
5,300000006,Ava,Coleman,Female,30,Wales,Blue Collar,09.Jan.15,122443.77
6,100000007,Dorothy,Thomson,Female,34,England,Blue Collar,11.Jan.15,42879.84
7,200000008,Lisa,Knox,Female,48,Scotland,Other,11.Jan.15,36680.17
8,300000009,Ruth,Campbell,Female,33,Wales,White Collar,11.Jan.15,74284.35
9,100000010,Dominic,Parr,Male,42,England,White Collar,12.Jan.15,10912.45

In [161]:
#sum of a column

df1['Balance'].sum()

576528.6

In [162]:
#Max and Min Values:

df1['Age'].max()

48

In [163]:
df1['Age'].min()

21

In [165]:
#Mean 
df['Balance'].mean()

39677.73921500011

In [166]:
#Mean of rows (By passing axis = 1)
df1.mean(axis=1)

0    3.337128e+07
1    1.333457e+08
2    3.336720e+07
3    1.000005e+08
4    3.334523e+07
5    1.000408e+08
6    3.334764e+07
7    6.667891e+07
8    1.000248e+08
9    3.333699e+07
dtype: float64

In [167]:
#Standard Deviation
df['Balance'].std()

29720.158572073615

# Missing Values

In [175]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

npn = np.nan
df1 = DataFrame([[10,20,npn],[npn,30,40],[50,60,70],[npn,npn,npn]])
df1

      0     1     2
0  10.0  20.0   NaN
1   NaN  30.0  40.0
2  50.0  60.0  70.0
3   NaN   NaN   NaN

In [176]:
#Removing Na values:

df1.dropna()

      0     1     2
2  50.0  60.0  70.0

In [177]:
#Remove rows which have all values = Na (last row is removed)

df1.dropna(how='all')

      0     1     2
0  10.0  20.0   NaN
1   NaN  30.0  40.0
2  50.0  60.0  70.0

In [178]:
df2 = DataFrame([[1,2,3],[npn,npn,4],[5,6,7],[npn,npn,npn]])
df2

     0    1    2
0  1.0  2.0  3.0
1  NaN  NaN  4.0
2  5.0  6.0  7.0
3  NaN  NaN  NaN

In [180]:
df1.dropna(thresh=2)

      0     1     2
0  10.0  20.0   NaN
1   NaN  30.0  40.0
2  50.0  60.0  70.0

In [181]:
df1

      0     1     2
0  10.0  20.0   NaN
1   NaN  30.0  40.0
2  50.0  60.0  70.0
3   NaN   NaN   NaN

In [183]:
df1.fillna(0)

      0     1     2
0  10.0  20.0   0.0
1   0.0  30.0  40.0
2  50.0  60.0  70.0
3   0.0   0.0   0.0

# Sorting and Ranking

In [193]:
#Sorting:

data = Series(randn(10))
data

0   -0.256759
1    1.586225
2    0.822342
3   -0.521286
4   -0.561474
5    0.190007
6   -2.019770
7    0.819229
8    0.852784
9   -1.067086
dtype: float64

In [194]:
data.sort_values()

6   -2.019770
9   -1.067086
4   -0.561474
3   -0.521286
0   -0.256759
5    0.190007
7    0.819229
2    0.822342
8    0.852784
1    1.586225
dtype: float64

In [195]:
#Rank

data.rank()

0     5.0
1    10.0
2     8.0
3     4.0
4     3.0
5     6.0
6     1.0
7     7.0
8     9.0
9     2.0
dtype: float64